//Данните имат променливи
/* имаме седем типа данни
Типовете данни са представени по седем начина
String, Number, Boolean, Undefined, Null, BigInt, Symbol
 Референтен тип - Object - Function
 Типове данни ги съхраняваме в променливи - имат имена наричиме ги индентификатори
 Let _name = "John";
 Name !== name
 Променливите г иизползваме да съхраняваме стойности. 
 Референтраната стойност означава, че не държим данни вътре, а държим адреса
 ( Тези референции са скрити от нас )

 let a;
 console.log(a) -- undefined !== undeclaredVariable
 
 ФУНКЦИИ
Деклариране и извикване на функция

Function - наименуван списък от инструкции 
method - Когато функцията е част от обект

Функциите могат да приемат параметри и да връщат резултати
параметър = аргумент !

*/
function printStars(count) {
  console.log("*".repeat(count));
}
printStars(10);

/*
Оператори и изрази
Аритметически = събиране, изваждане , делене , модулно делене ( остатък ) и други (( Експоненция c = a ** b) --> означава повдиднато на степен)

Унарна --> a++
Бинарна --> a+b
Тернарна --> ((5 > 7) ? 4 : 10); --> (condition) ? value_if_true : value_if_false --> five is smaller than 7 so the false value is the answear = 10 

Комбиниране на условия
const val = 'yes' && null && false --> Оператор " и "

Оператор или 
const val = false || "" || 5;
val is 5 
*/
